---
kind: method
id: M:Autodesk.Revit.DB.ElementId.ToString
source: html/db92e345-5a0e-fbad-892a-bea2bd9de941.htm
---
# Autodesk.Revit.DB.ElementId.ToString Method

Gets a String representation of the value of the id.

## Syntax (C#)
```csharp
public override string ToString()
```